Tekla Open API Reference for Tekla Structures 2025
Phase.GetUserProperty Method (String, Double)
 Retrieves a double property for the phase.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool GetUserProperty(
	string Name,
	ref double Value
)
Public Function GetUserProperty (
	Name As String,
	ByRef Value As Double
) As Boolean
Parameters
Name
Type: System.String
The name of the property to be retrieved, in capital letters.
Value
Type: System.Double
The return value.
Return Value
Type: Boolean
True if the value was returned successfully.
See Also
Reference
Phase Class
GetUserProperty Overload
Tekla.Structures.Model Namespace